package pkg1;

public class Main {

	public static void main(String[] args) {
		/* 7월 31일(월) ~ 8월 6일(일) 회고록
		 * 
		 * 8월 1일부터 SQLD 공부 시작했다. 시험일은 9.9(토)
		 * 어려운 시험은 아니라고 하나, SQL 솔직히 나는 좀 약하다고 생각한다.
		 * 하여, 열심히 공부 중이다. 깃허브 1day 1commit, SQLD, 인프런 강의
		 * 하루에 이 3개를 하고 있긴 한데, 뭔가 부족한 것 같아서 더 추가할 계획이다.
		 * 지금 생각하고 있는 건, 토이 프로젝트를 만들던가 '이펙티브 자바' 책을 구매하여 공부하거나
		 * 생각 중이다. 동아리 회원이 지금 이펙티브 자바 책 읽고 있다는데 너무 어렵다고 해서
		 * 두렵긴 하지만 그래도 언젠가 해야 한다면 바로 지금 하는게 맞는 것 같다.
		 * 
		 * 자바 알고리즘 공부는 내가 여지껏 잘못하고 있었던 것 같다.
		 * 왜 다시 보면 까먹는지...?!
		 * 그건 내 머릿 속으로 생각하지 않고 코드만 작성 후 외우려고 했던 이유인 것 같다.
		 * 뭐 이런 내가 정말 바보같지만, 이것 또한 나인걸... 다시 싹 갈아엎고 생각하며 접근해야곘다.
		 * 인터넷에서 이런 글을 봤다. 개발자는 코드 잘 만드는 사람이 아닌 문제 해결 능력이 있어야 하는
		 * 사람이 해야 한다고... 정말 공감한다. 나 또한 후자가 되기 위해 열심히 할 계획이다.
		 * 
		 * 오늘 일요일! 최정원 죽었다 생각하고 열심히 해보자~
		 *  
		 * 
		 */
	}

}
